{
    "A detailed documentation with explanations and all further information can be found on our GitHub page:": "Eine ausführliche Dokumentation mit Erläuterungen und allen weiteren Informationen finden Sie auf unserer GitHub-Seite:",
    "Active": "Aktiv",
    "Adapter Instructions": "Adapter-Anleitung",
    "Adapter Instructions:": "Anleitung zu diesem Adapter:",
    "Adapter: Log Parser": "Adapter: Log Parser",
    "Add CSS in JSON": "Fügen Sie CSS in JSON hinzu",
    "Add CSS to JSON Log": "CSS im JSON hinzufügen",
    "Advanced Settings": "Erweiterte Einstellungen",
    "Blacklist": "Blacklist",
    "Blacklist Expressions": "Blacklist-Ausdrücke",
    "Blacklist Instructions": "Blacklist-Anleitung",
    "Blacklist expressions": "Blacklist-Ausdrücke",
    "Clean": "Bereinigen",
    "Column order for JSON table": "Spalten-Reihenfolge für JSON-Tabelle",
    "Columns for JSON table": "Spalten für JSON-Tabelle",
    "Comment": "Kommentar",
    "Date": "Datum",
    "Date format": "Datumsformat",
    "Dateformat": "Datumsformat",
    "Detailed filter instructions": "Detaillierte Anleitung zu den Filtern",
    "English": "Englisch",
    "Examples (without quotes): '[# entries]', '(#) ', '# entries: '": "Beispiele (ohne Anführungszeichen): '[# Einträge]', '(#) ', '# Einträge: '",
    "Expert Settings": "Experten-Einstellungen",
    "Expert settings": "Experteneinstellungen",
    "Filter Rules (Log Parser)": "Filter-Regeln (Log Parser)",
    "Filter/Parser Rules": "Parser-Regeln (Filter)",
    "For each set filter (rule), states are created under 'logparser.[instance].filters'.": "Für jeden gesetzten Filter (Regel) werden jeweils Datenpunkte unterhalb von logparser.[instanz].filters angelegt.",
    "Further Settings": "Weitere Einstellungen",
    "General": "Allgemein",
    "German": "Deutsch",
    "Global Blacklist": "Globale Blacklist",
    "Global blacklist": "Globale Blacklist",
    "Here you can change the order of the columns. As additional column ts (timestamp) is always added. In VIS etc. simply hide it if necessary.": "Hier können Sie die Reihenfolge der Spalten ändern. Als zusätzliche Spalte wird immer ts (timestamp) hinzugefügt. In VIS etc. ggf. einfach ausblenden.",
    "Here you can define the update interval of the data points. For performance reasons, it is not recommended to select a poll value that is too low. Less than two seconds cannot be selected.": "Hier können Sie das Aktualisierungsintervall der Datenpunkte festlegen. Aus Performance-Gründen wird davon abgeraten, einen zu niedrigen Poll-Wert zu wählen. Weniger als zwei Sekunden können nicht ausgewählt werden.",
    "How many different JSON tables do you need": "Wie viele verschiedene JSON-Tabellen benötigen Sie?",
    "If enabled: sorts the log entries in descending order, i.e. newest on top. If disabled: sorts the log entries ascending, so oldest on top.": "Wenn aktiviert: Sortiert die Log-Einträge in absteigender Reihenfolge, d. h. die neuesten oben. Wenn deaktiviert: Sortiert die Log-Einträge aufsteigend, also die ältesten oben.",
    "In the filters, today's or yesterday's date can be replaced by 'Today' or 'Yesterday' in the date format for using hash character (#). Other terms can be defined here instead of 'Today'/'Yesterday'.": "In den Filtern kann das heutige oder gestrige Datum durch „Heute“ oder „Gestern“ im Datumsformat für die Verwendung von Rautenzeichen (#) ersetzt werden. Statt „Heute“/„Gestern“ können hier auch andere Begriffe definiert werden.",
    "Instance": "Instanz",
    "Instructions": "Anleitungen",
    "Interval for updating states": "Update-Intervall: Datenpunkte aktualisieren",
    "IntroTxt1": "Mit diesem Adapter können die Log-Ausgaben aller Adapter (inkl. der Scripts des JS-Adapters) geparst werden.",
    "IntroTxt2": "Dazu einfach hier in den Einstellungen in der Registerkarte 'Parser-Regeln (Filter)' die entsprechenden Regeln hinterlegen. Bei Installation werden bereits mehrere Regeln als Beispiel gesetzt.",
    "Logs generated by the JavaScript adapter start with 'script.js.Script_Name:'. If this option is enabled, they are automatically removed.": "Vom JavaScript-Adapter generierte Protokolle beginnen mit „script.js.Script_Name:“. Wenn diese Option aktiviert ist, werden sie automatisch entfernt.",
    "Max": "Max",
    "MaxTxt": "Die maximale Anzahl an Logeinträgen, die in den Datenpunkten behalten werden (ältere werden entfernt). Bitte keine zu hohe Anzahl, je größer, desto mehr Auslastung für den Adapter und damit deinen ioBroker-Server. Eine Zahl von 100 hat sich gut bewährt.",
    "Maximum number of log entries": "Maximale Anzahl Logeinträge",
    "Merge": "Merge",
    "MergeTxt": "Dieser Text wird jeder Logzeile vorangestellt, wenn <i>Merge</i> aktiviert ist. Das <code>#</code>-Zeichen wird dabei dann durch die Anzahl der Logs mit dem gleichen Inhalt ersetzt. Sonderzeichen wie z.B. <code>[](){}</code> sind erlaubt.<br>Beispiele (ohne Anführungszeichen): '<code>[# Einträge]</code>', '<code>(#) </code>', '<code># Einträge: </code>'.",
    "Name": "Name",
    "NumJsonTablesTxt1": "Hiermit können zusätzliche Datenpunkte für die Ausgabe als JSON-Tabelle in VIS erzeugt werden, mit denen es möglich ist, in einer VIS-Tabelle zwischen den einzelnen Filtern umzuschalten (z.B. 'Homematic', 'Warnungen', 'Fehler' usw.), die dann dynamisch jeweils in dieser einen Tabelle ausgegeben werden.",
    "NumJsonTablesTxt2": "Hier die Anzahl der unterschiedlichen JSON-Tabellen angeben, in denen du das brauchst. Diese werden angelegt unter 'visualization.table1', 'visualization.table2', usw. Zum deaktivieren: 0 eintragen (dann werden diese zusätzlichen Datenpunkte nicht erstellt).",
    "NumJsonTablesTxtLabel": "Für wie viele unterschiedliche JSON-Tabellen benötigst du das?",
    "Number": "Anzahl",
    "Number (0 = deactivated)": "Anzahl (0 = deaktiviert)",
    "Number of JSON tables used in VIS": "Anzahl verwendeter JSON-Tabellen in VIS",
    "OrderTxt": "Hier kann die Reihenfolge der einzelnen Spalten verändert werden. Als zusätzliche Spalte wird immer ts (timestamp) hinzugefügt. In VIS usw. bei Bedarf einfach ausblenden.<br>Falls du weniger als 4 Spalten brauchst: Wähle einfach einen Eintrag der ersten Spalten aus, die du brauchst, und blende den Rest dann mit dem VIS JSON-Table-Widget (o.ä.) aus.",
    "Other settings": "Andere Einstellungen",
    "Output for 'Today'": "Ausgabe für 'Heute'",
    "Output for 'Yesterday'": "Ausgabe für 'Gestern'",
    "Parser Rules (Filter)": "Parser-Regeln (Filter)",
    "Parser-Rules (filter)": "Parser-Regeln (Filter)",
    "ParserRules.Welcome": "Willkommen beim Log-Parser-Adapter. Aktueller ioBroker-Forum-Artikel",
    "Prefixed text (# is replaced by number)": "Vorangestellter Text (# wird durch Zahl ersetzt)",
    "Prepended text (# is replaced by number)": "Vorangestellter Text (# wird durch Anzahl ersetzt)",
    "Quantity": "Menge",
    "Remove 'script.js.Script_Name'": "Entferne 'script.js.Script_Name'",
    "Remove PID": "PID entfernen",
    "Remove only script.js": "Entferne nur script.js",
    "Remove script.js.Script_Name": "Entferne script.js.Script_Name",
    "Remove script.js.Script_Name:": "script.js.Script_Name entfernen:",
    "RemovePidTxt": "Der js-Controller Version 2.0 oder größer fügt Logs teils vorne die PID in Klammern hinzu, also z.B. '(12345) Terminated: Without reason'. Durch Aktivierung dieser Option werden die PIDs inkl. Klammern, wie z.B. `(12345)`, aus den Logzeilen entfernt.",
    "RemoveScriptJsTxt": "Vom JavaScript-Adapter generierte Logs beginnen mit 'script.js.Script_Name:'. Wenn diese Option aktiviert ist, werden diese automatisch entfernt.",
    "Replace date with 'Today' / 'Yesterday'": "Datum durch 'Heute' / 'Gestern' ersetzen",
    "Replace date with 'Today' / 'Yesterday':": "Datum durch 'Heute' / 'Gestern' ersetzen:",
    "ReplaceDateTxt": "In den Filtern kann beim Datumsformat für mittels Hash-Zeichen (#) das heutige bzw. gestrige Datum durch 'Heute' bzw. 'Gestern' ersetzt werden. Hier können andere Begriffe statt 'Heute'/'Gestern' definiert werden.",
    "Seconds": "Sekunden",
    "Select accordingly": "Entsprechend auswählen",
    "Severity": "Log-Level",
    "Sort descending": "Absteigend sortieren",
    "Sort descending (newest on top)": "Absteigend sortieren (neuester oben)",
    "SortTxt": "Wenn aktiviert: sortiert die Logeinträge absteigend, also neuester oben. Wenn deaktiviert: Sortiert die Logeinträge aufsteigend, also ältester oben.",
    "Sorting": "Sortierung",
    "Specify here the number of different JSON tables in which you need this. These will be created under 'visualization.table1', 'visualization.table2', etc. To disable: enter 0 (then these additional data points will not be created).": "Geben Sie hier die Anzahl der verschiedenen JSON-Tabellen an, in denen Sie diese benötigen. Diese werden unter 'visualization.table1', 'visualization.table2' usw. angelegt. Deaktivieren: 0 eingeben (dann werden diese zusätzlichen Datenpunkte nicht angelegt).",
    "Start": "Start",
    "Text": "Text",
    "Text for 'Merge' (combine logs):": "Text für 'Merge' (Protokolle zusammenführen):",
    "Text for 'Merge' Logs": "Text für 'Merge' (Logs zusammenfassen)",
    "Text for Today": "Text für Heute",
    "Text for Yesterday": "Text für Gestern",
    "The js controller partly adds the PID in brackets to the front of logs, e.g. '(12345) Terminated: Without reason'. Enabling this option removes the PIDs including brackets, e.g. '(12345)', from the log lines.": "Der js-Controller fügt teilweise die PID in Klammern an den Anfang von Protokollen, z.B. '(12345) Beendet: Ohne Grund'. Das Aktivieren dieser Option entfernt die PIDs inklusive Klammern, z. '(12345)' aus den Protokollzeilen.",
    "The maximum number of log entries that will be kept in the datapoints (older ones will be removed). Please do not set too high a number, the larger, the more load for the adapter and thus your ioBroker server. A number of 100 has worked well.": "Die maximale Anzahl von Protokolleinträgen, die in den Datenpunkten aufbewahrt werden (ältere werden entfernt). Bitte stellen Sie keine zu hohe Zahl ein, je größer, desto mehr Last für den Adapter und damit Ihren ioBroker Server. Ein Wert von 100 hat sich als gut bewährt.",
    "This can be used to create additional data points for output as a JSON table in VIS, with which it is possible to switch between the individual filters in a VIS table (e.g. 'Homematic', 'Warnings', 'Errors' etc.), which are then dynamically output in this one table in each case.": "Hiermit können zusätzliche Datenpunkte zur Ausgabe als JSON-Tabelle im VIS erstellt werden, mit denen in einer VIS-Tabelle zwischen den einzelnen Filtern umgeschaltet werden kann (z.B. ‚Homematic‘, ‚Warnungen‘, ‚Fehler‘ etc.), die dann jeweils in dieser einen Tabelle dynamisch ausgegeben werden.",
    "This text is prepended to each log line when merge is enabled. The # character is then replaced by the number of logs with the same content. Special characters like [](){} are allowed.": "Dieser Text wird jeder Protokollzeile vorangestellt, wenn die Zusammenführung aktiviert ist. Das #-Zeichen wird dann durch die Anzahl der Protokolle mit gleichem Inhalt ersetzt. Sonderzeichen wie [](){} sind erlaubt.",
    "Update Interval": "Aktualisierungs-Intervall",
    "Update interval: Update data points": "Aktualisierungsintervall: Datenpunkte aktualisieren",
    "Version": "Version",
    "Visualization": "Visualisierung",
    "Welcome to Log-Parser adapter": "Willkommen beim Log-Parser-Adapter",
    "Whitelist AND": "Whitelist UND",
    "Whitelist OR": "Whitelist ODER",
    "With this you can add additional CSS in the JSON.": "Damit können Sie zusätzliches CSS im JSON hinzufügen.",
    "cssJSON_1": "Hiermit kannst du im JSON zusätzlich CSS hinzufügen. Hier ein Beispiel:",
    "cssJSON_2": "Im folgenden Beispiel war alles deaktiviert:",
    "cssJSON_3": "Hier waren alle Optionen aktiviert:",
    "cssJSON_4": "Beachte hierbei die CSS-Klassen wie <code>logDate</code>, <code>logSeverity</code>, etc., mit denen du diese Werte jeweils separat in CSS formatieren kannst.",
    "cssJSON_5": "Zusätzlich gibt es je nach Log-Stufe (warn, error, usw.) noch jeweils <code>logWarn</code>, <code>logError</code>, etc. als CSS-Klassen.<br>Im obigen Beispiel wurde ein Log mit Stufe 'warn' gefiltert, also wurde jeweils noch die CSS-Klasse <code>logWarn</code> hinzugefügt.",
    "date, from, message, severity": "Datum, Quelle, Nachricht, Log-Level",
    "date, from, severity, message": "Datum, Quelle, Log-Level, Nachricht",
    "date, message, from, severity": "Datum, Nachricht, Quelle, Log-Level",
    "date, message, severity, from": "Datum, Nachricht, Log-Level, Quelle",
    "date, severity, from, message": "Datum, Log-Level, Quelle, Nachricht",
    "date, severity, message, from": "Datum, Log-Level, Nachricht, Quelle",
    "expandHelpTxt": "Hier klicken, um die Hilfe aufzuklappen",
    "from, date, message, severity": "Quelle, Datum, Nachricht, Log-Level",
    "from, date, severity, message": "Quelle, Datum, Log-Level, Nachricht",
    "from, message, date, severity": "Quelle, Nachricht, Datum, Log-Level",
    "from, message, severity, date": "Quelle, Nachricht, Log-Level, Datum",
    "from, severity, date, message": "Quelle, Log-Level, Datum, Nachricht",
    "from, severity, message, date": "Quelle, Log-Level, Nachricht, Datum",
    "message, date, from, severity": "Nachricht, Datum, Quelle, Log-Level",
    "message, date, severity, from": "Nachricht, Datum, Log-Level, Quelle",
    "message, from, date, severity": "Nachricht, Quelle, Datum, Log-Level",
    "message, from, severity, date": "Nachricht, Quelle, Log-Level, Datum",
    "message, severity, date, from": "Nachricht, Log-Level, Datum, Quelle",
    "message, severity, from, date": "Nachricht, Log-Level, Quelle, Datum",
    "severity, date, from, message": "Log-Level, Datum, Quelle, Nachricht",
    "severity, date, message, from": "Log-Level, Datum, Nachricht, Quelle",
    "severity, from, date, message": "Log-Level, Quelle, Datum, Nachricht",
    "severity, from, message, date": "Log-Level, Quelle, Nachricht, Datum",
    "severity, message, date, from": "Log-Level, Nachricht, Datum, Quelle",
    "severity, message, from, date": "Log-Level, Nachricht, Quelle, Datum",
    "updateIntTxt": "Neu reinkommende Logeinträge werden gesammelt und regelmäßig in die Datenpunkte geschrieben. Hiermit kann das Intervall definiert werden. Hinweis: Die Datenpunkte werden nur geschrieben, falls es eine Änderung gab. Dennoch ist es aus Performance-Sicht nicht sinnvoll, hier ein zu kurzes Intervall einzustellen. Kleiner als 2 Sekunden ist nicht erlaubt.",
    "Remove PID:": "PID entfernen:",
    "Remove (COMPACT):": "COMPACT entfernen:",
    "If a adapter running in compact mode, it will add the word compact in brackets to the front of logs, e.g. '(COMPACT) handleConnectionInfo'. Enabling this option removes '(COMPACT)' from the log lines.": "Wenn ein Adapter im Kompaktmodus läuft, fügt er das Wort 'compact' in Klammern an den Anfang der Protokolle, z. '(COMPACT) handleConnectionInfo'. Durch Aktivieren dieser Option wird „(COMPACT)“ aus den Protokollzeilen entfernt.",
    "Remove (COMPACT)": "Entferne (COMPACT)",
    "How many different JSON tables do you need?": "Wie viele verschiedene JSON-Tabellen benötigen Sie?"
}
