{
    "A detailed documentation with explanations and all further information can be found on our GitHub page:": "Szczegółową dokumentację z wyjaśnieniami i wszystkimi dodatkowymi informacjami można znaleźć na naszej stronie GitHub:",
    "Active": "Aktywny",
    "Adapter Instructions": "Instrukcje Adapter ",
    "Adapter Instructions:": "Instrukcje dotyczące adaptera:",
    "Adapter: Log Parser": "Zasilacz: Parser Logu ",
    "Add CSS in JSON": "Dodaj CSS w JSON",
    "Add CSS to JSON Log": "Dodaj CSS do dziennika JSON",
    "Advanced Settings": "Dodatkowe Opcje",
    "Blacklist": "Czarnej listy",
    "Blacklist Expressions": "Czarnej Listy Wyrażeń",
    "Blacklist Instructions": "Instrukcje Zignoruj. ",
    "Blacklist expressions": "Wyrażenia z czarnej listy",
    "Clean": "Czyste",
    "Column order for JSON table": "Zamówić głośniki do JSON stół",
    "Columns for JSON table": "Kolumny dla JSON stół",
    "Comment": "Komentarz",
    "Date": "Data",
    "Date format": "Format daty",
    "Dateformat": "Format daty",
    "Detailed filter instructions": "Szczegółowa instrukcja filtra ",
    "English": "Angielski",
    "Examples (without quotes): '[# entries]', '(#) ', '# entries: '": "Przykłady (bez cudzysłowów): '[# wpisów]', '(#)', '# wpisów: '",
    "Expert Settings": "Ustawienia Eksperta ",
    "Expert settings": "Ustawienia eksperckie",
    "Filter Rules (Log Parser)": "Zasady Filtr (Analizator Logów)",
    "Filter/Parser Rules": "Reguły filtrowania / analizowania",
    "For each set filter (rule), states are created under 'logparser.[instance].filters'.": "Dla każdego zestawu filtrów (reguła), państwa są tworzone zgodnie 'z pomocą narzędzia narzędziu logparser.[wystąpienie].filtry'.",
    "Further Settings": "Dodatkowe Opcje",
    "General": "Ogólne",
    "German": "Niemiecki",
    "Global Blacklist": "Globalny Czarna Lista",
    "Global blacklist": "Globalna czarna lista",
    "Here you can change the order of the columns. As additional column ts (timestamp) is always added. In VIS etc. simply hide it if necessary.": "Tutaj możesz zmienić kolejność kolumn. Jako dodatkowa kolumna zawsze dodawana jest ts (timestamp). W VIS itp. po prostu ukryj go, jeśli to konieczne.",
    "Here you can define the update interval of the data points. For performance reasons, it is not recommended to select a poll value that is too low. Less than two seconds cannot be selected.": "Tutaj możesz zdefiniować interwał aktualizacji punktów danych. Ze względu na wydajność nie zaleca się wybierania zbyt niskiej wartości ankiety. Nie można wybrać mniej niż dwie sekundy.",
    "How many different JSON tables do you need": "Ile różnych tabel JSON potrzebujesz",
    "If enabled: sorts the log entries in descending order, i.e. newest on top. If disabled: sorts the log entries ascending, so oldest on top.": "Jeśli ta opcja jest włączona: sortuje wpisy dziennika w kolejności malejącej, tj. najnowsze na górze. Jeśli wyłączone: sortuje wpisy w dzienniku rosnąco, najstarsze na górze.",
    "In the filters, today's or yesterday's date can be replaced by 'Today' or 'Yesterday' in the date format for using hash character (#). Other terms can be defined here instead of 'Today'/'Yesterday'.": "W filtrach dzisiejszą lub wczorajszą datę można zastąpić „Dzisiaj” lub „Wczoraj” w formacie daty, aby użyć znaku krzyżyka (#). Tutaj można zdefiniować inne terminy zamiast „Dzisiaj”/„Wczoraj”.",
    "Instance": "Instancja",
    "Instructions": "Instrukcje",
    "Interval for updating states": "Interwał aktualizacji państwa",
    "IntroTxt1": "Ten adapter może być stosowany do analizy zarejestrowanych danych wyjściowych wszystkich kart (w tym skrypty sieciowej w JS).",
    "IntroTxt2": "Po prostu określamy według zasad tutaj w ustawieniach na zasady analizatora składni (filtra) na karcie\". Podczas instalacji, niektóre zasady są już zainstalowane jako przykładów.",
    "Logs generated by the JavaScript adapter start with 'script.js.Script_Name:'. If this option is enabled, they are automatically removed.": "Dzienniki generowane przez adapter JavaScript zaczynają się od „script.js.Script_Name:”. Jeśli ta opcja jest włączona, są one automatycznie usuwane.",
    "Max": "Max",
    "MaxTxt": "Maksymalna liczba wpisów do dziennika, które przechowywane są w stanach Zjednoczonych (stare wpisy są usuwane). Proszę nie umieszczać zbyt dużej liczby, im większa liczba, tym większe obciążenie zasilacza i w ten sposób serwer ioBroker. Liczba 100 okazała się bardzo dobra.",
    "Maximum number of log entries": "Maksymalna liczba wpisów w dzienniku ",
    "Merge": "Korespondencji seryjnej",
    "MergeTxt": "Ten tekst umieszczony w przedniej części każdego wiersza dziennika, jeśli połączenie jest aktywowane. Symbol # zamiana liczba czasopism o tej samej treści.",
    "Name": "Nazwa",
    "NumJsonTablesTxt1": "Za pomocą tej opcji, państwa mogą być tworzone dla wyjścia, Jak tabele JSON w VIS. To pozwala na przełączanie się pomiędzy poszczególnymi filtrami w tabeli VIS (na przykład, 'Homematic', 'ostrzeżenie', 'błąd', itp.), które potem dynamicznie wyświetlać w jednej tabeli.",
    "NumJsonTablesTxt2": "Wpisz tutaj liczbę różnych tabel, JSON, gdzie jest to potrzebne. Są one tworzone pod 'wizualizacja.tablica 1', 'wizualizacja.таблица2 itp., Aby wyłączyć wpisz 0 (wtedy te państwa nie są tworzone).",
    "NumJsonTablesTxtLabel": "Ile różnych tabel w formacie JSON jest to potrzebne?",
    "Number": "Ilość",
    "Number (0 = deactivated)": "Liczba (0 = wyłączony)",
    "Number of JSON tables used in VIS": "Ilość tabel JSON, który jest używany w висе",
    "OrderTxt": "Tutaj możesz zmienić kolejność kolumn. Jako dodatkowe kolumny TC (etykiety) zawsze dodaje. W висе itp. po prostu ukryć go w razie potrzeby.",
    "Other settings": "Inne ustawienia",
    "Output for 'Today'": "Wyjście do \"Dziś\"",
    "Output for 'Yesterday'": "Wyjście na \"wczoraj\"",
    "Parser Rules (Filter)": "Zasady Analizatora (Filtra)",
    "Parser-Rules (filter)": "Parser-Rules (filtr)",
    "ParserRules.Welcome": "Witamy w adapterze parsera dziennika. ",
    "Prefixed text (# is replaced by number)": "Tekst z prefiksem (# jest zastępowane numerem)",
    "Prepended text (# is replaced by number)": "Poprzedzony tekst (# zamień na liczbę)",
    "Quantity": "Ilość",
    "Remove 'script.js.Script_Name'": "Usuń plik „script.js.Script_Name”",
    "Remove PID": "Usunąć PID",
    "Remove only script.js": "Usuń tylko script.js",
    "Remove script.js.Script_Name": "Usuń script.js.Script_Name",
    "Remove script.js.Script_Name:": "Usuń skrypt.js.Script_Name:",
    "RemovePidTxt": "Wersja kontrolera z JS 2.0 lub wyżej, dodaje PID w nawiasach przed czasopisma, na przykład, '(12234) wygasa: bez przyczyny'. Za pomocą tej opcji Пидов, w tym w nawiasach, na przykład (1234), mogą być usunięte z wierszy dziennika.",
    "RemoveScriptJsTxt": "Dzienniki generowane przez adapter JavaScript zaczynają się od „script.js.Script_Name:”. ",
    "Replace date with 'Today' / 'Yesterday'": "Wymienić datę wczoraj 'dzisiaj'/\"",
    "Replace date with 'Today' / 'Yesterday':": "Zamień datę na „Dzisiaj” / „Wczoraj”:",
    "ReplaceDateTxt": "W filtrach, można zastąpić dzisiejszą lub wczorajszą datę z \"dziś\" lub \"na wczoraj\" w kolumnie date format za pomocą skrótu-symbole (#). W tych obszarach, inne określenia zamiast \"Dziś\" / \"wczoraj\" może być określony.",
    "Seconds": "Sekund",
    "Select accordingly": "Wybierz odpowiednio",
    "Severity": "Powaga",
    "Sort descending": "Sortuj malejąco",
    "Sort descending (newest on top)": "Sortowanie malejąco (najnowsze na górze)",
    "SortTxt": "Jeśli aktywny jest: sortowanie rekordów dziennika w porządku malejącym, najnowsze na górze. Jeśli ta opcja jest wyłączona: sortuje wpisy w kolejności rosnącej, czyli stare góry.",
    "Sorting": "Sortowanie",
    "Specify here the number of different JSON tables in which you need this. These will be created under 'visualization.table1', 'visualization.table2', etc. To disable: enter 0 (then these additional data points will not be created).": "Określ tutaj liczbę różnych tabel JSON, w których tego potrzebujesz. Zostaną one utworzone w „visualization.table1”, „visualization.table2” itd. Aby wyłączyć: wprowadź 0 (wtedy te dodatkowe punkty danych nie zostaną utworzone).",
    "Start": "Początek",
    "Text": "Tekst",
    "Text for 'Merge' (combine logs):": "Tekst dla „Scal” (połącz logi):",
    "Text for 'Merge' Logs": "Tekst \"fuzja\" dzienniki",
    "Text for Today": "Tekst na dziś",
    "Text for Yesterday": "Tekst za wczoraj",
    "The js controller partly adds the PID in brackets to the front of logs, e.g. '(12345) Terminated: Without reason'. Enabling this option removes the PIDs including brackets, e.g. '(12345)', from the log lines.": "Kontroler js częściowo dodaje PID w nawiasach na początku logów, np. „(12345) Zakończono: bez powodu”. Włączenie tej opcji usuwa PIDy wraz z nawiasami, np. „(12345)” z wierszy dziennika.",
    "The maximum number of log entries that will be kept in the datapoints (older ones will be removed). Please do not set too high a number, the larger, the more load for the adapter and thus your ioBroker server. A number of 100 has worked well.": "Maksymalna liczba wpisów dziennika, które będą przechowywane w punktach danych (starsze zostaną usunięte). Proszę nie ustawiać zbyt dużej liczby, im większa, tym większe obciążenie dla adaptera, a tym samym dla Twojego serwera ioBroker. Liczba 100 działała dobrze.",
    "This can be used to create additional data points for output as a JSON table in VIS, with which it is possible to switch between the individual filters in a VIS table (e.g. 'Homematic', 'Warnings', 'Errors' etc.), which are then dynamically output in this one table in each case.": "Można to wykorzystać do utworzenia dodatkowych punktów danych do wyprowadzenia w postaci tabeli JSON w VIS, za pomocą której można przełączać się między poszczególnymi filtrami w tabeli VIS (np. „Homematic”, „Ostrzeżenia”, „Błędy” itp.), które są następnie dynamicznie wyprowadzane w tej jednej tabeli w każdym przypadku.",
    "This text is prepended to each log line when merge is enabled. The # character is then replaced by the number of logs with the same content. Special characters like [](){} are allowed.": "Ten tekst jest dodawany na początku każdego wiersza dziennika, gdy włączone jest scalanie. Znak # jest wtedy zastępowany liczbą logów o tej samej treści. Dozwolone są znaki specjalne, takie jak [](){}.",
    "Update Interval": "Interwał Aktualizacji",
    "Update interval: Update data points": "Interwał aktualizacji: Aktualizuj punkty danych",
    "Version": "Wersja",
    "Visualization": "Wizualizacja",
    "Welcome to Log-Parser adapter": "Witamy w adapterze Log-Parser",
    "Whitelist AND": "Biały i",
    "Whitelist OR": "Biały lub",
    "With this you can add additional CSS in the JSON.": "Dzięki temu możesz dodać dodatkowy CSS w JSON.",
    "cssJSON_1": "Pozwala to na dodanie CSS do JSON. ",
    "cssJSON_2": "W poniższym przykładzie wszystkie opcje zostały wyłączone:",
    "cssJSON_3": "W poniższym przykładzie wszystkie opcje zostały włączone:",
    "cssJSON_4": "Zwróć uwagę na klasy CSS, takie jak <code> logDate </code>, <code> logSeverity </code> itp., Które umożliwiają osobne formatowanie tych wartości w CSS",
    "cssJSON_5": "Dodatkowo, w zależności od poziomu dziennika (ostrzeżenie, błąd itp.), Istnieją klasy CSS: <code> logWarn </code>, <code> logError </code> itp. <br> W powyższym przykładzie ",
    "date, from, message, severity": "data, od, wiadomość, dotkliwość",
    "date, from, severity, message": "data, od, powaga, wiadomość",
    "date, message, from, severity": "data, wiadomość, od, powaga",
    "date, message, severity, from": "data, wiadomość, dotkliwość, od",
    "date, severity, from, message": "data, dotkliwość, od, wiadomość",
    "date, severity, message, from": "data, dotkliwość, wiadomość, od",
    "expandHelpTxt": "Wskazówka: Kliknij niebieski pasek bezpośrednio nad tym tekstem, aby wyświetlić pomoc.",
    "from, date, message, severity": "od, data, wiadomość, dotkliwość",
    "from, date, severity, message": "od, data, dotkliwość, wiadomość",
    "from, message, date, severity": "od, wiadomość, data, dotkliwość",
    "from, message, severity, date": "od, wiadomość, dotkliwość, data",
    "from, severity, date, message": "od, dotkliwość, data, wiadomość",
    "from, severity, message, date": "od, dotkliwość, wiadomość, data",
    "message, date, from, severity": "wiadomość, data, od, powaga",
    "message, date, severity, from": "wiadomość, data, dotkliwość, od",
    "message, from, date, severity": "wiadomość, od, data, powaga",
    "message, from, severity, date": "wiadomość, od, ważność, data",
    "message, severity, date, from": "wiadomość, dotkliwość, data, od",
    "message, severity, from, date": "wiadomość, dotkliwość, od, data",
    "severity, date, from, message": "dotkliwość, data, od, wiadomość",
    "severity, date, message, from": "dotkliwość, data, wiadomość, od",
    "severity, from, date, message": "dotkliwość, od, data, wiadomość",
    "severity, from, message, date": "dotkliwość, od, wiadomość, data",
    "severity, message, date, from": "dotkliwość, wiadomość, data, od",
    "severity, message, from, date": "dotkliwość, wiadomość, od, data",
    "updateIntTxt": "Nowe wpisy przychodzącej gromadzone i regularnie pisał do Stanów. To dla określenia przedziału. Uwaga: państwa są aktualizowane tylko jeżeli nastąpiły zmiany. Niemniej jednak, z punktu widzenia wydajności, to nie ma sensu, aby ustawić interwał, który jest zbyt krótki i mniej niż 2 sekundy nie są dozwolone.",
    "Remove PID:": "Usuń PID:",
    "Remove (COMPACT):": "Usuń (KOMPAKTOWY):",
    "If a adapter running in compact mode, it will add the word compact in brackets to the front of logs, e.g. '(COMPACT) handleConnectionInfo'. Enabling this option removes '(COMPACT)' from the log lines.": "Jeśli adapter działa w trybie kompaktowym, doda słowo kompaktowy w nawiasach z przodu dzienników, np. „(COMPACT) handleConnectionInfo”. Włączenie tej opcji usuwa „(COMPACT)” z wierszy dziennika.",
    "Remove (COMPACT)": "Usuń (KOMPAKTOWY)"
}
